/****************************************Copyright (c)****************************************************
**--------------File Info---------------------------------------------------------------------------------
** File name:				bsp_ds18b20.c
** Last modified Date:          
** Last Version:		   
** Descriptions:							
**--------------------------------------------------------------------------------------------------------
** Created by:			FiYu
** Created date:		2015-4-12
** Version:			    1.0
** Descriptions:		DS18B20Çı¶¯				
**--------------------------------------------------------------------------------------------------------
** Modified by:			July
** Modified date:		2022.06.30
** Version:					0.1.0
** Descriptions:		The board support package for DS18B20.
** Rechecked by:		July	
**********************************************************************************************************/
#include "bsp_ds18b20.h"

 /**************************************************************************************
 * Ãè  Êö : ÅäÖÃDS18B20ÓÃµ½µÄI/O¿Ú
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : ÎŞ
 **************************************************************************************/
static void DS18B20_GPIO_Config(void)
{		
	GPIO_InitTypeDef GPIO_InitStructure;

	__HAL_RCC_GPIOB_CLK_ENABLE(); 
															   
  GPIO_InitStructure.Pin = DS18B20_PIN;	
  GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;  //ÍÆÍìÊä³ö 
  GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_MEDIUM; 
  HAL_GPIO_Init(DS18B20_PORT, &GPIO_InitStructure);
	
	HAL_GPIO_WritePin(DS18B20_PORT, DS18B20_PIN, GPIO_PIN_SET);	 //DS18B20Êı¾İÒı½Å³õÊ¼»¯ÅäÖÃÎª¸ßµçÆ½Êä³ö
}
 /**************************************************************************************
 * Ãè  Êö : ÅäÖÃÊ¹DS18B20-DATAÒı½Å±äÎªÊäÈëÄ£Ê½
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : ÎŞ
 **************************************************************************************/
static void DS18B20_Mode_IPU(void)
{
 	  GPIO_InitTypeDef GPIO_InitStructure;
	
	  GPIO_InitStructure.Pin = DS18B20_PIN; 
	  GPIO_InitStructure.Mode = GPIO_MODE_INPUT;	   //ÉÏÀ­ÊäÈë
	  HAL_GPIO_Init(DS18B20_PORT, &GPIO_InitStructure);
}

 /**************************************************************************************
 * Ãè  Êö : ÅäÖÃÊ¹DS18B20-DATAÒı½Å±äÎªÊä³öÄ£Ê½
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : ÎŞ
 **************************************************************************************/
static void DS18B20_Mode_Out_PP(void)
{
 	GPIO_InitTypeDef GPIO_InitStructure;
															   
  GPIO_InitStructure.Pin = DS18B20_PIN;	

  GPIO_InitStructure.Mode = GPIO_MODE_OUTPUT_PP;    //ÍÆÍìÊä³ö  
  GPIO_InitStructure.Speed = GPIO_SPEED_FREQ_MEDIUM;
  HAL_GPIO_Init(DS18B20_PORT, &GPIO_InitStructure);
}

 /**************************************************************************************
 * Ãè  Êö : Ö÷»ú¸ø´Ó»ú·¢ËÍ¸´Î»Âö³å
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : ÎŞ
 **************************************************************************************/
static void DS18B20_Rst(void)
{
	DS18B20_Mode_Out_PP();     //Ö÷»úÉèÖÃÎªÍÆÍìÊä³ö 
	
	DS18B20_DATA_OUT(LOW);      //Ö÷»úÖÁÉÙ²úÉú480usµÄµÍµçÆ½¸´Î»ĞÅºÅ
	delay_us(750);
	DS18B20_DATA_OUT(HIGH);   //Ö÷»úÔÚ²úÉú¸´Î»ĞÅºÅºó£¬Ğè½«×ÜÏßÀ­¸ß
	delay_us(15);   //´Ó»ú½ÓÊÕµ½Ö÷»úµÄ¸´Î»ĞÅºÅºó£¬»áÔÚ15~60usºó¸øÖ÷»ú·¢Ò»¸ö´æÔÚÂö³å
}

 /**************************************************************************************
 * Ãè  Êö : ¼ì²â´Ó»ú¸øÖ÷»ú·µ»ØµÄ´æÔÚÂö³å
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : 0£º³É¹¦   1£ºÊ§°Ü
 **************************************************************************************/
static uint8_t DS18B20_Presence(void)
{
	uint8_t pulse_time = 0;
	
	DS18B20_Mode_IPU();     //Ö÷»úÉèÖÃÎªÉÏÀ­ÊäÈë
	
/* µÈ´ı´æÔÚÂö³åµÄµ½À´£¬´æÔÚÂö³åÎªÒ»¸ö60~240usµÄµÍµçÆ½ĞÅºÅ 
	 * Èç¹û´æÔÚÂö³åÃ»ÓĞÀ´Ôò×ö³¬Ê±´¦Àí£¬´Ó»ú½ÓÊÕµ½Ö÷»úµÄ¸´Î»ĞÅºÅºó£¬»áÔÚ15~60usºó¸øÖ÷»ú·¢Ò»¸ö´æÔÚÂö³å
	 */
	while( DS18B20_DATA_IN() && pulse_time<100 )
	{
		pulse_time++;
		delay_us(1);
	}	

	if( pulse_time >=100 )  //¾­¹ı100usºó£¬´æÔÚÂö³å¶¼»¹Ã»ÓĞµ½À´
		return 1;             //¶ÁÈ¡Ê§°Ü
	else                 //¾­¹ı100usºó£¬´æÔÚÂö³åµ½À´
		pulse_time = 0;   //ÇåÁã¼ÆÊ±±äÁ¿½
	
	while( !DS18B20_DATA_IN() && pulse_time<240 )  // ´æÔÚÂö³åµ½À´£¬ÇÒ´æÔÚµÄÊ±¼ä²»ÄÜ³¬¹ı240us
	{
		pulse_time++;
		delay_us(1);
	}	
	if( pulse_time >=240 ) // ´æÔÚÂö³åµ½À´£¬ÇÒ´æÔÚµÄÊ±¼ä³¬¹ıÁË240us
		return 1;        //¶ÁÈ¡Ê§°Ü
	else
		return 0;
}

 /**************************************************************************************
 * Ãè  Êö : ´ÓDS18B20¶ÁÈ¡Ò»¸öbit
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : u8 
 **************************************************************************************/
static uint8_t DS18B20_Read_Bit(void)
{
	uint8_t dat;
	
	/* ¶Á0ºÍ¶Á1µÄÊ±¼äÖÁÉÙÒª´óÓÚ60us */	
	DS18B20_Mode_Out_PP();
	/* ¶ÁÊ±¼äµÄÆğÊ¼£º±ØĞëÓÉÖ÷»ú²úÉú >1us <15us µÄµÍµçÆ½ĞÅºÅ */
	DS18B20_DATA_OUT(LOW);
	delay_us(10);
	
	/* ÉèÖÃ³ÉÊäÈë£¬ÊÍ·Å×ÜÏß£¬ÓÉÍâ²¿ÉÏÀ­µç×è½«×ÜÏßÀ­¸ß */
	DS18B20_Mode_IPU();
	
	if( DS18B20_DATA_IN() == SET )
		dat = 1;
	else
		dat = 0;
	
	/* Õâ¸öÑÓÊ±²ÎÊıÇë²Î¿¼Ê±ĞòÍ¼ */
	delay_us(45);
	
	return dat;
}

 /**************************************************************************************
 * Ãè  Êö : ´ÓDS18B20¶ÁÒ»¸ö×Ö½Ú£¬µÍÎ»ÏÈĞĞ
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : u8  
 **************************************************************************************/
uint8_t DS18B20_Read_Byte(void)
{
	uint8_t i, j, dat = 0;	
	
	for(i=0; i<8; i++) 
	{
		j = DS18B20_Read_Bit();		//´ÓDS18B20¶ÁÈ¡Ò»¸öbit
		dat = (dat) | (j<<i);
	}
	
	return dat;																																																																																
}

 /**************************************************************************************
 * Ãè  Êö : Ğ´Ò»¸ö×Ö½Úµ½DS18B20£¬µÍÎ»ÏÈĞĞ
 * Èë  ²Î : u8
 * ·µ»ØÖµ : ÎŞ 
 **************************************************************************************/
void DS18B20_Write_Byte(uint8_t dat)
{
	uint8_t i, testb;
	DS18B20_Mode_Out_PP();
	
	for( i=0; i<8; i++ )
	{
		testb = dat&0x01;
		dat = dat>>1;		
		/* Ğ´0ºÍĞ´1µÄÊ±¼äÖÁÉÙÒª´óÓÚ60us */
		if (testb)
		{			
			DS18B20_DATA_OUT(LOW);
			delay_us(8);  //1us < Õâ¸öÑÓÊ± < 15us
			
			DS18B20_DATA_OUT(HIGH);
			delay_us(58);   //58us+8us>60us
		}		
		else
		{			
			DS18B20_DATA_OUT(LOW);  
			/* 60us < Tx 0 < 120us */
			delay_us(70);
			
			DS18B20_DATA_OUT(HIGH);			
			/* 1us < Trec(»Ö¸´Ê±¼ä) < ÎŞÇî´ó*/
			delay_us(2);
		}
	}
}

 /**************************************************************************************
 * Ãè  Êö : ÆğÊ¼DS18B20
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : ÎŞ 
 **************************************************************************************/
void _DS18B20_Start(void)
{
	DS18B20_Rst();	          //Ö÷»ú¸ø´Ó»ú·¢ËÍ¸´Î»Âö³å
	DS18B20_Presence();	      //¼ì²â´Ó»ú¸øÖ÷»ú·µ»ØµÄ´æÔÚÂö³å
	DS18B20_Write_Byte(0XCC);		 // Ìø¹ı ROM 
	DS18B20_Write_Byte(0X44);		  // ¿ªÊ¼×ª»» 
}

 /**************************************************************************************
 * Ãè  Êö : DS18B20³õÊ¼»¯º¯Êı
 * Èë  ²Î : ÎŞ
 * ·µ»ØÖµ : u8
 **************************************************************************************/
uint8_t DS18B20_Init(void)
{
	DS18B20_GPIO_Config();   
	DS18B20_Rst();
	
	return DS18B20_Presence();
}

 /**************************************************************************************
 * Ãè  Êö : ´ÓDS18B20¶ÁÈ¡ÎÂ¶ÈÖµ
 * Èë  ²Î : ÎŞ  
 * ·µ»ØÖµ : float 
 **************************************************************************************/
float DS18B20_Get_Temp(void)
{
	uint8_t tpmsb, tplsb;
	short s_tem;
	float f_tem;
	
	DS18B20_Rst();	   
	DS18B20_Presence();	 
	DS18B20_Write_Byte(0XCC);				/* Ìø¹ı ROM */
	DS18B20_Write_Byte(0X44);				/* ¿ªÊ¼×ª»» */
	
	DS18B20_Rst();
  DS18B20_Presence();
	DS18B20_Write_Byte(0XCC);				/* Ìø¹ı ROM */
  DS18B20_Write_Byte(0XBE);				/* ¶ÁÎÂ¶ÈÖµ */
	
	tplsb = DS18B20_Read_Byte();		 
	tpmsb = DS18B20_Read_Byte(); 
	
	s_tem = tpmsb<<8;
	s_tem = s_tem | tplsb;
	
	if( s_tem < 0 )		/* ¸ºÎÂ¶È */
		f_tem = (~s_tem+1) * 0.0625;	
	else
		f_tem = s_tem * 0.0625;
	
	return f_tem; 	
}


/*************************************END OF FILE******************************/
